# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
# anchors:
#   - [10,13, 16,30, 33,23]  # P3/8
#   - [30,61, 62,45, 59,119]  # P4/16
#   - [116,90, 156,198, 373,326]  # P5/32



# anchors:
#   - [20, 26, 34, 44, 56, 72]  # P3/8
#   - [61, 80, 98, 128, 156, 204]  # P4/16
#   - [184, 242, 298, 390, 476, 620]  # P5/32

anchors:
  - [1.08, 1.19, 3.42, 4.41, 6.63, 11.38]   # P3/8
  - [2.51, 2.91, 4.76, 7.29, 10.35, 22.63]   # P4/16
  - [12.01, 10.52, 16.62, 24.77, 59.72, 60.97]   # P5/32
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   # [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   # [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   # [-1, 3, C3, [128]],
   # [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   # [-1, 6, C3, [256]],
   # [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   # [-1, 9, C3, [512]],
   # [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   # [-1, 3, C3, [1024]],
   # [-1, 1, SPPF, [1024, 5]],  # 9
    [-1,1, reslcnet,[256, 1]],       #80*80 0
    [-1,1, reslcnet,[512, 2]],       #40*40 1
    [-1,1, reslcnet,[1024, 3]]        #20*20 2
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],   # 3
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #4
   [[-1, 1], 1, Concat, [1]],  # cat backbone P4  #5
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 0], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 3], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[10, 13, 16], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
